{"pageProps":{"userId":1,"id":2,"slug":"getting-familiar-with-the-basics-of-linux","title":"Getting Familiar with the Basics of Linux","description":"When starting out on your Linux journey, there are a few concepts that are keys to working with Linux successfully ...","body":"<br><br><p class='fs-5 mb-4'>When starting out on your Linux journey, there are a few concepts that are keys to working with Linux successfully. In this article, we take a look at some of them including how space is organised in Linux, some basic shell prompts that are useful to know that come in handy with everyday tasks.</p><h2 class='fw-bolder mb-4 mt-5'>Tree Structure of the Linux File System Hierarchy</h2><p class='fs-5 mb-4'>Linux organizes its space as a file system hierarchy starting with the root folder. All other subfolders are nested inside this <strong>root</strong> folder (denoted as a / in the figure below). This can be visualized as a tree structure. All users have their own folder under the <strong>home</strong> folder. When you first start the Linux shell prompt, you are asked to setup a username and password. This becomes your default directory or <strong>home directory</strong> for all future use.</p><br><img src='file-hierarchy.png'/><br><br><br><p class='fs-5 mb-4'>Use this Linux shell prompt to print the current working directory.</p><code>$ pwd <br>/home/sadafzahra</code><br><p class='fs-5 mb-4'><br><br>To explore and view the contents of your working directory ls.</p><code>$ ls <br>code  data</code><br><br><p class='fs-5 mb-4'>Use this shell prompt to navigate to a specified path in the tree structure.</p><code>$ cd /<i>foldername</i>  </code><br><br><p class='fs-5 mb-4'>To go up one level in the tree structure use the following.</p><code>$ cd ..</code><h2 class='fw-bolder mb-4 mt-5'>Basic Shell Prompts for common File tasks</h2><br><p class='fs-5 mb-4'>Use the following to make a new directory.</p><code>$ mkdir <i>directoryname</i></code><br><br><br><p class='fs-5 mb-4'>To create a file use the following commands or shell prompts</p><code>$ cat > <i>filename</i> <br>// press enter to see file content here<br>// ctrl+ d to escape back into the shell prompt</code><br><br><br><p class='fs-5 mb-4'>To view the contents of a file use this</p><code>$ cat <i>test.txt</i><br>test content shown here</code><br><br><br><p class='fs-5 mb-4'>And to remove a file the following prompts</p><code>$ rm <i>filename</i></code>"},"__N_SSG":true}