{"pageProps":{"userId":1,"id":1,"slug":"three-design-principles-for-your-css-layout","title":"Three design principles for your CSS layout","description":"Industry experts agree that typography, spacing and colour form the key basic principles for designing things like layouts ...","body":"<br><br><img width='100%' src='layout.png'/><br><br><p class='fs-5 mb-4'>Industry experts agree that <strong>typography</strong>, <strong>spacing</strong> and <strong>colour</strong> form the key basic principles for designing things like layouts for the web. They are the three ingredients or building blocks to work with to create a cohesive composition.</p><p class='fs-5 mb-4'>In this article, we explore how to create a simple single column layout with these design principles in detail. HTML and CSS will be the technologies that we will use as tools to create this layout. Doing this practice will help you learn key concepts and build your web development skills.</p><h2 class='fw-bolder mb-4 mt-5'>1. Typography</h2><p class='fs-5 mb-4'>To set the type, CSS provides the following properties, <code>font-family</code>, <code>font-size</code>, <code>line-height</code> and <code>font-weight</code>.<br><br>In this example, we are setting the <code>font-family</code> to Helvetica. It is web-safe, well-supported by browsers and very popular. We will set the font weight explicitly. The Helvetica font provides two standard font weights. We will set those explicitly to what the standard typically is <strong>400</strong> for <code>p</code> tag and <strong>700</strong> for <code>h1</code> tag. <p class='fs-5 mb-4'>Typography systems also set a ratio to the font-size and line-height. This is helpful as it helps you build visual hierarchy in your design. A good rule of thumb is to set the line-height to approximately 150% of the font size.</p><code>body {<br>font-family: Helvetica;<br>}<br><br>h1 {<br>font-weight: 700;<br>font-size: 2em;<br>line-height: 3em;<br>}<br><br>p {<br>font-weight: 400;<br>font-size: 1em;<br>line-height: 1.5em;<br>}</code><h2 class='fw-bolder mb-4 mt-5'>2. Spacing</h2><p class='fs-5 mb-4'>A lot of CSS frameworks and libraries use rows and columns to build layouts. In this example, we will are creating a simple layout so we will only work with rows. To implement design specifications like fixed or fluid width and manage the inner and outer spacing around your html elements, it is helpful to understand how the CSS box model works. You can find more information about it here on <a href='https://www.w3schools.com/css/css_boxmodel.asp'>w3schools</a>.</p><p class='fs-5 mb-4'>For this example, we are only specifying the <code>padding</code> property for spacing around the row element. I have added a simple <code>border</code> property to use as a guideline when working with the spacing.</p><code>.row {<br>padding: 0 1em;<br>border: solid 1px black;<br>}</code><h2 class='fw-bolder mb-4 mt-5'>3. Colour</h2><p class='fs-5 mb-4'>We will use a simple monochromatic greyscale colour palette with two combinations: black and white. They also have a sharp contrast and are polar opposites in colour theory. These CSS properties will help us create and apply a dark theme to the html element: <code>colour</code> and <code>background</code>.</p><code>.dark {<br>background: #000;<br>colour: #fff;<br>}</code><p class='fs-5 mb-4'><br>Here is the complete code on Code Pen with the resulting layout.<br><a href='https://codepen.io/Sadaf1223/pen/xxLvRag'>https://codepen.io/Sadaf1223/pen/xxLvRag</a></p>"},"__N_SSG":true}